package com.bo.listener;/*@ClassName ContextLoaderListener
 *@Description:监听器，初始化一组数据供Servlet享用
 *@author yc_shang
 *@Date2019/10/4
 *@Version 1.0
 **/

import com.bo.entity.Film;
import com.bo.entity.User;

import javax.servlet.ServletContext;
import javax.servlet.ServletContextEvent;
import javax.servlet.ServletContextListener;
import javax.servlet.annotation.WebListener;
import java.time.LocalDate;
import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;

//监视TomCat的启动
@WebListener
public class ContextLoaderListener implements ServletContextListener {
    @Override
    //容器初始化方法
   public void contextInitialized(ServletContextEvent sce) {
        System.out.println("容器启动");
        //创建并生成用户数据列表
        List<User> userList = new ArrayList<>(6);
        User[] user = {
                new User(1,"aaa@qq.com","698d51a19d8a121ce581499d7b701668","盏茶作酒","江苏徐州", LocalDate.of(2018,9,12),"看过所有新海诚知名的电影，《秒速五厘米》、《云之彼端，约定的地方》、《追逐繁星的孩子》、《言叶之庭》，甚至早期的《星之声》我也看过。这次的《你的名字》我个人认为是这几部中最好的一部，不得不说，新海诚有点让我刮目相看。","1.jpg"),
                new User(2,"bbb@qq.com","bcbe3365e6ac95ea2c0343a2395834dd","@TTT","江苏泰州", LocalDate.of(2018,9,12),"教育一定要因材施教，良好的教育方法是迈向成功的开始。熊猫虽说身体肥胖，没有尖牙利爪，不是学习武术的好材料，但是经过浣熊师傅的开创性的教育，最终也可以一跃而起，凭自己的实力从师傅手里夺得了包子。","2.jpg"),
                new User(3,"ccc@qq.com","310dcbbf4cce62f762a2aaa148d556bd","图图酱酱","江苏无锡", LocalDate.of(2018,9,12),"《烈火英雄》是中国电影史上第一次大规模聚焦消防员群体的影片，观看完《烈火英雄》让我对消防员充满了深深的敬意，下面是电影《烈火英雄》观后感，《烈火英雄》用震撼的场面、感人的情节，向我们展示了消防救援队伍的英勇形象，在此希望我们的英雄们，每次执行任务，都能平安归来。","3.jpg"),
                new User(4,"ddd@qq.com","550a141f12de6341fba65b0ad0433500","义","新疆伊犁", LocalDate.of(2018,9,12),"看过所有新海诚知名的电影，《秒速五厘米》、《云之彼端，约定的地方》、《追逐繁星的孩子》、《言叶之庭》，甚至早期的《星之声》我也看过。这次的《你的名字》我个人认为是这几部中最好的一部，不得不说，新海诚有点让我刮目相看。","4.jpg"),
                new User(5,"eee@qq.com","15de21c670ae7c3f6f3f1f37029303c9","O.","安徽宿迁", LocalDate.of(2018,9,12),"教育一定要因材施教，良好的教育方法是迈向成功的开始。熊猫虽说身体肥胖，没有尖牙利爪，不是学习武术的好材料，但是经过浣熊师傅的开创性的教育，最终也可以一跃而起，凭自己的实力从师傅手里夺得了包子。","5.jpg"),
                new User(6,"fff@qq.com","fae0b27c451c728867a567e8c1bb4e53","骄纵","江苏南通", LocalDate.of(2018,9,12),"《烈火英雄》是中国电影史上第一次大规模聚焦消防员群体的影片，观看完《烈火英雄》让我对消防员充满了深深的敬意，下面是电影《烈火英雄》观后感，《烈火英雄》用震撼的场面、感人的情节，向我们展示了消防救援队伍的英勇形象，在此希望我们的英雄们，每次执行任务，都能平安归来。","6.jpg"),
        };
        userList = Arrays.asList(user);
        List<Film> filmList = new ArrayList<>(20);
        Film[] film = {
                new Film(1,"我和我的祖国",9.4,"陈凯歌, 张一白……","杜江，葛优，欧豪，张译……","国语",155,"剧情","film1.jpg","该电影是2019年中国大陆多段式剧情片，是中国电影界庆祝中华人民共和国成立70周年的献礼片，“庆祝中华人民共和国成立70周年优秀国产新片展映”7部重点影片之一。影片以“历史瞬间，全民记忆，迎头相撞”的串联手法，讲述了70年间不同职业、背景及身份下的普通人在时代背景下发生的不平凡故事。"),
                new Film(2,"中国机长",9.3,"刘伟强","张涵予,欧豪,杜江,袁泉,张天爱,李沁","国语",111,"剧情","film2.jpg","电影《中国机长》根据2018年5月14日四川航空3U8633航班机组成功处置特情真实事件改编：机组执行航班任务时，在万米高空突遇驾驶舱风挡玻璃爆裂脱落、座舱释压的极端罕见险情，生死关头，他们临危不乱、果断应对、正确处置，确保了机上全部人员的生命安全，创造了世界民航史上的奇迹。"),
                new Film(3,"攀登者",9.2,"李仁港","吴京,章子怡,张译,井柏然,胡歌,王景春,何琳,陈龙,刘小锋,曲尼次仁,拉旺罗布,多布杰","国语",125,"剧情","film3.jpg","1960年，中国登山队向珠峰发起冲刺，完成了世界首次北坡登顶这一不可能的任务。15 年后，方五洲和曲松林在气象学家徐缨的帮助下，带领李国梁、杨光等年轻队员再次挑战世界之巅。迎接他们的将是更加 严酷的现实，也是生与死的挑战......"),
                new Film(4,"飞驰人生",9.2,"韩寒","沈腾、黄景瑜、尹正、尹昉","国语",90,"剧情","film4.jpg","曾经叱咤风云的拉力赛车手张驰（沈腾 饰），五年前因私自赛车而被禁赛。从天堂跌落谷底，张驰饱尝生活的艰辛。他忍辱负重，洗心革面，终于争取到了解禁的判决。在此之后，他重新找到亲如兄弟的领航员孙宇强（尹正 饰），决心共同冲击本年度的巴音布鲁克拉力赛。然而在此之前，张驰必须重考驾照，改装赛车，拉到赞助。每一步都充满艰难，他忍受着旁人的奚落嘲讽，忍受着现实的冰冷残酷，无论如何都不改变前进的目标。当他好不容易走到了赛场，还将面对禁赛这几年崛起的新秀林臻东（黄景瑜 饰）的挑战。"),
                new Film(5,"烈火英雄",9.2,"陈国辉","黄晓明、杜江、谭卓","国语",120,"剧情","film5.jpg","滨海市海港码头发生管道爆炸，整个罐区的原油都顺着A01油罐往外流，化成火海和阵阵爆炸，威胁全市、全省，甚至邻国的安全。慌乱的市民们四处奔逃，一辆辆消防车却逆向冲进火海……"),
                new Film(6,"哪吒之魔童降世",9.2,"饺子","吕艳婷,囧森瑟夫,瀚墨,陈浩,绿绮,张珈铭,杨卫","国语",110,"动画","film6.jpg","天地灵气孕育出一颗能量巨大的混元珠，元始天尊将混元珠提炼成灵珠和魔丸，灵珠投胎为人，助周伐纣时可堪大用；而魔丸则会诞出魔王，为祸人间。元始天尊启动了天劫咒语，3年后天雷将会降临，摧毁魔丸。太乙受命将灵珠托生于陈塘关李靖家的儿子哪吒身上。然而阴差阳错，灵珠和魔丸竟然被掉包。本应是灵珠英雄的哪吒却成了混世大魔王。调皮捣蛋顽劣不堪的哪吒却徒有一颗做英雄的心。然而面对众人对魔丸的误解和即将来临的天雷的降临，哪吒是否命中注定会立地成魔？他将何去何从？"),
                new Film(7,"你的名字",9.0,"新海诚","神木隆之介，上白石萌音，长泽雅美，市原悦子 ","日语",106,"动画","film10.jpg","在远离大都会的小山村，住着巫女世家出身的高中女孩宫水三叶（上白石萌音 配音）。校园和家庭的原因本就让她充满烦恼，而近一段时间发生的奇怪事件，又让三叶摸不清头脑。不知从何时起，三叶在梦中就会变成一个住在东京的高中男孩。那里有陌生的同学和朋友，有亲切的前辈和繁华的街道，一切都是如此诱人而真实。"),
                new Film(8,"烟花",7.5,"李仁港"," 广濑铃,菅田将晖, 宫野真守,松隆子,花泽","国语",125,"动画","film8.jpg","炎炎夏日，茂下町的烟花大会即将举行。就读于当地高中的及川奈砂（广濑铃 配音）并未沉浸在愉快祥和的气氛之中，她即将随母亲（松隆子 配音）搬家到另一个城市，心中满是失落。在某次即兴的游泳比赛时，奈砂击败同班同学岛田典道（菅田将晖 配音）和安昙祐介（宫野真守 配音）。随后她坦白喜欢祐介，希望烟花大会时能与对方一同游玩。"),
        };
        filmList = Arrays.asList(film);
        //获得全局变量
        ServletContext servletContext = sce.getServletContext();
        //设置全局变量属性，将用户和电影列表数据记入，整个应用可以共享
        servletContext.setAttribute("userList",userList);
        servletContext.setAttribute("filmList",filmList);
    }

    @Override
    //容器销毁方法
    public void contextDestroyed(ServletContextEvent sce)
    {
        System.out.println("容器销毁");
    }
}
